app/Controllers/Client.php

    public function list()
    {
        if (!$this->isAuthorized()) {
            return redirect()->route('page_salarie');
        }
        $clients = $this->clientModel->findAll();
---
SELECT *
FROM `client`