app/Controllers/Profil.php

    public function list()
    {
        if (!$this->isAuthorized()) {
            return redirect()->route('list_mission');
        }
        $profils = $this->profilModel->findAll();
---
SELECT *
FROM `profil`