app/Controllers/Salarie.php

SELECT *
FROM `salarie`
---
    public function list()
    {
        if (!$this->isAuthorized()) {
            return redirect()->route('list_mission');
        }
        $listSalaries = $this->salarieModel->findAll();