app/Models/Mission.php

    public function findJoinAll()
    {
        return $this
            ->select('mission.ID_MISSION,
        mission.INTITULE_MISSION,
        mission.DESCRIPTION,
        mission.DATE_DEBUT,
        mission.DATE_FIN,
        client.RAISON_SOCIAL as RAISON_SOCIAL,
        client.ID_CLIENT')
            ->join('client', 'client.ID_CLIENT = mission.ID_CLIENT')
            ->findAll();
---
SELECT `mission`.`ID_MISSION`, `mission`.`INTITULE_MISSION`, `mission`.`DESCRIPTION`, `mission`.`DATE_DEBUT`, `mission`.`DATE_FIN`, `client`.`RAISON_SOCIAL` as `RAISON_SOCIAL`, `client`.`ID_CLIENT`
FROM `mission`
JOIN `client` ON `client`.`ID_CLIENT` = `mission`.`ID_CLIENT`