app/Models/Salarie.php

    public function getProfil($idSalarie)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('salarie_profil');
        $builder->join('profil', 'profil.ID_PROFIL = salarie_profil.ID_PROFIL');
        $query = $builder->getWhere(['ID_SALARIE' => $idSalarie]);
---
SELECT *
FROM `salarie_profil`
JOIN `profil` ON `profil`.`ID_PROFIL` = `salarie_profil`.`ID_PROFIL`
WHERE `ID_SALARIE` = '1'